app/views/entities/_form.html.erb

    <div class="row g-2 m-0">
      <%= form.fields_for :contacts, @entity.contacts.to_a do |contact_form| %>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."entity_id" = 41

      <%= form.label :role_id, "Tipo de Entidade", class: "form-label" %>
      <%= form.collection_select :role_id, Role.all, :id, :name,
            { prompt: "Escolher..." },
            class: "form-select #{'is-invalid' if @entity.errors[:role_id].any?}" %>
---
SELECT "roles".* FROM "roles"