app/views/entities/index.html.erb

          <td>
            <% entity.contacts.where.not(contact_type: nil).where.not(value: nil).each do |contact| %>
              <%= contact.contact_type.titleize %>: <%= contact.value %>
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."entity_id" = 40 AND "contacts"."contact_type" IS NOT NULL AND "contacts"."value" IS NOT NULL