app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    if @contact.save
      redirect_to contacts_path, notice: "Contacto criado com sucesso"
    else
      @contacts = Contact.all
---
INSERT INTO "contacts" ("name", "created_at", "updated_at") VALUES ('Helio Macarao', '2025-06-26 06:26:36.881332', '2025-06-26 06:26:36.881332') RETURNING "id"
SELECT "contacts".* FROM "contacts"