app/controllers/entities_controller.rb

def index
  @roles = Role.order(:name) # for select input
  @entity_attributes = [
    "Nome", "Nacionalidade", "Identificação", "Gênero",
    "Nascimento", "Naturalidade", "Endereço", "Local de Emissão",
    "Data de Emissão", "Residência",
    "Contacto", "Papel"
  ]

  base = Entity.includes(:contacts, :role)

  if params[:query].present?
    keyword = "%#{params[:query].downcase}%"

    base = base.joins("LEFT JOIN contacts ON contacts.entity_id = entities.id")
               .where(
                 "LOWER(entities.full_name) LIKE :q OR LOWER(entities.nationality) LIKE :q OR LOWER(entities.id_number) LIKE :q OR LOWER(contacts.value) LIKE :q",
                 q: keyword
               )
  end

  if params[:role_id].present?
    base = base.where(role_id: params[:role_id])
  end

  @entities = base.distinct
---
SELECT "roles".* FROM "roles" ORDER BY "roles"."name" ASC
SELECT "contacts".* FROM "contacts" WHERE "contacts"."entity_id" IN (3, 4, 1, 2, 5)
SELECT "roles".* FROM "roles" WHERE "roles"."id" IN (38, 35)
SELECT DISTINCT entities.*, COUNT(DISTINCT parcels_sent.id) AS sent_count, COUNT(DISTINCT parcels_received.id) AS received_count FROM "entities" LEFT OUTER JOIN "parcels" ON "parcels"."sender_id" = "entities"."id" LEFT OUTER JOIN "parcels" "received_parcels_entities" ON "received_parcels_entities"."recipient_id" = "entities"."id" LEFT JOIN parcels AS parcels_sent ON parcels_sent.sender_id = entities.id LEFT JOIN parcels AS parcels_received ON parcels_received.recipient_id = entities.id GROUP BY "entities"."id"
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 35 LIMIT 1

def create
  @entity = Entity.new(entity_params)

  if @entity.save
    redirect_to entities_path, notice: "Entidade criada com sucesso!"
  else
    @entity.contacts.build if @entity.contacts.empty?
---
INSERT INTO "entities" ("full_name", "nationality", "id_type", "id_number", "gender", "date_of_birth", "place_of_birth", "marital_status", "height_cm", "address", "issuance_country", "issuance_location", "issuance_date", "expiry_date", "residence_status", "created_at", "updated_at", "role_id") VALUES ('IRCMM', '', 'NUIT', '7845646', '', NULL, '', '', NULL, '', '', '', NULL, NULL, '', '2025-07-19 12:07:11.388921', '2025-07-19 12:07:11.388921', NULL) RETURNING "id"
SELECT "contacts".* FROM "contacts" WHERE "contacts"."entity_id" = 39 AND "contacts"."id" = 37

  def update
    if @entity.update(entity_params)
      redirect_to entities_path, notice: "Entidade atualizada com sucesso!"
    else
      @entity.contacts.build if @entity.contacts.empty?
---
UPDATE "entities" SET "updated_at" = '2025-07-18 17:34:03.181849', "role_id" = 38 WHERE "entities"."id" = 4
SELECT 1 AS one FROM "contacts" WHERE "contacts"."entity_id" = 39 LIMIT 1
SELECT "contacts".* FROM "contacts" WHERE "contacts"."entity_id" = 3

  def destroy
    @entity.destroy
---
DELETE FROM "entities" WHERE "entities"."id" = 40

    def set_entity
      @entity = Entity.find(params[:id])
      @entity.contacts.build if @entity.contacts.empty?
---
SELECT "entities".* FROM "entities" WHERE "entities"."id" = 40 LIMIT 1
SELECT 1 AS one FROM "entities" LIMIT 1
SELECT "entities".* FROM "entities" WHERE "entities"."id" = 1 LIMIT 1
SELECT "contacts".* FROM "contacts" WHERE "contacts"."entity_id" = 3
SELECT 1 AS one FROM "contacts" WHERE "contacts"."entity_id" = 40 LIMIT 1