app/controllers/parcels_controller.rb

  def index
    @branches = Branch.order(:name)
    @parcels = Parcel.includes(:sender, :recipient, :origin_branch, :destination_branch)

    if params[:query].present?
      keyword = "%#{params[:query].downcase}%"
      @parcels = @parcels.where(
        "LOWER(parcel_code) LIKE :q OR LOWER(contents_description) LIKE :q OR LOWER(tracking_status) LIKE :q",
        q: keyword
      )
---
SELECT "branches".* FROM "branches" ORDER BY "branches"."name" ASC
SELECT "parcels".* FROM "parcels" ORDER BY "parcels"."created_at" DESC
SELECT "parcels".* FROM "parcels" WHERE "parcels"."tracking_status" = 'Em trânsito' ORDER BY "parcels"."created_at" DESC