app/controllers/roles_controller.rb

  def index
    @roles = Role.order(:name)
---
SELECT "roles".* FROM "roles" ORDER BY "roles"."name" ASC

  def create
    @role = Role.new(role_params)
    if @role.save
---
INSERT INTO "roles" ("name", "role_group", "created_at", "updated_at", "description") VALUES ('Funcionario', NULL, '2025-07-18 14:48:17.503980', '2025-07-18 14:48:17.503980', NULL) RETURNING "id"

  def update
    if @role.update(role_params)
---
UPDATE "roles" SET "role_group" = '', "updated_at" = '2025-07-18 14:55:34.290637', "description" = 'm;cm;s' WHERE "roles"."id" = 36

  def destroy
    @role.destroy
---
DELETE FROM "roles" WHERE "roles"."id" = 34

    def set_role
      @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1